# Multiples Indices

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'1.0.1'

In [80]:
df = pd.read_csv('../../datasets/population/poblacion.csv')
df.head()

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2011,2012,2013,2014,2015,2016,2017,2018,2019,Unnamed: 64
0,Aruba,ABW,"Population, total",SP.POP.TOTL,"54,211.0","55,438.0","56,225.0","56,695.0","57,032.0","57,360.0",...,"102,046.0","102,560.0","103,159.0","103,774.0","104,341.0","104,872.0","105,366.0","105,845.0",nan,nan
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,"8,996,973.0","9,169,410.0","9,351,441.0","9,543,205.0","9,744,781.0","9,956,320.0",...,"30,117,413.0","31,161,376.0","32,269,589.0","33,370,794.0","34,413,603.0","35,383,128.0","36,296,400.0","37,172,386.0",nan,nan
2,Angola,AGO,"Population, total",SP.POP.TOTL,"5,454,933.0","5,531,472.0","5,608,539.0","5,679,458.0","5,735,044.0","5,770,570.0",...,"24,220,661.0","25,107,931.0","26,015,780.0","26,941,779.0","27,884,381.0","28,842,484.0","29,816,748.0","30,809,762.0",nan,nan
3,Albania,ALB,"Population, total",SP.POP.TOTL,"1,608,800.0","1,659,800.0","1,711,319.0","1,762,621.0","1,814,135.0","1,864,791.0",...,"2,905,195.0","2,900,401.0","2,895,092.0","2,889,104.0","2,880,703.0","2,876,101.0","2,873,457.0","2,866,376.0",nan,nan
4,Andorra,AND,"Population, total",SP.POP.TOTL,"13,411.0","14,375.0","15,370.0","16,412.0","17,469.0","18,549.0",...,"83,747.0","82,427.0","80,774.0","79,213.0","78,011.0","77,297.0","77,001.0","77,006.0",nan,nan

In [81]:
df.drop(columns=['Country Code', 'Indicator Name', 'Indicator Code', 'Unnamed: 64'], inplace=True)
df.head()

,Country Name,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Aruba,"54,211.0","55,438.0","56,225.0","56,695.0","57,032.0","57,360.0","57,715.0","58,055.0","58,386.0",...,"101,669.0","102,046.0","102,560.0","103,159.0","103,774.0","104,341.0","104,872.0","105,366.0","105,845.0",nan
1,Afghanistan,"8,996,973.0","9,169,410.0","9,351,441.0","9,543,205.0","9,744,781.0","9,956,320.0","10,174,836.0","10,399,926.0","10,637,063.0",...,"29,185,507.0","30,117,413.0","31,161,376.0","32,269,589.0","33,370,794.0","34,413,603.0","35,383,128.0","36,296,400.0","37,172,386.0",nan
2,Angola,"5,454,933.0","5,531,472.0","5,608,539.0","5,679,458.0","5,735,044.0","5,770,570.0","5,781,214.0","5,774,243.0","5,771,652.0",...,"23,356,246.0","24,220,661.0","25,107,931.0","26,015,780.0","26,941,779.0","27,884,381.0","28,842,484.0","29,816,748.0","30,809,762.0",nan
3,Albania,"1,608,800.0","1,659,800.0","1,711,319.0","1,762,621.0","1,814,135.0","1,864,791.0","1,914,573.0","1,965,598.0","2,022,272.0",...,"2,913,021.0","2,905,195.0","2,900,401.0","2,895,092.0","2,889,104.0","2,880,703.0","2,876,101.0","2,873,457.0","2,866,376.0",nan
4,Andorra,"13,411.0","14,375.0","15,370.0","16,412.0","17,469.0","18,549.0","19,647.0","20,758.0","21,890.0",...,"84,449.0","83,747.0","82,427.0","80,774.0","79,213.0","78,011.0","77,297.0","77,001.0","77,006.0",nan

In [82]:
df = pd.melt(df, id_vars=['Country Name'], var_name='year', value_name='pob')
df.head()

  Country Name  year         pob
0        Aruba  1960    54,211.0
1  Afghanistan  1960 8,996,973.0
2       Angola  1960 5,454,933.0
3      Albania  1960 1,608,800.0
4      Andorra  1960    13,411.0

In [83]:
# Cambiando el formato de pob
pd.options.display.float_format = '{:,.1f}'.format

In [84]:
df.rename(columns={'Country Name': 'Country'}, inplace=True)
df

            Country  year         pob
0             Aruba  1960    54,211.0
1       Afghanistan  1960 8,996,973.0
2            Angola  1960 5,454,933.0
3           Albania  1960 1,608,800.0
4           Andorra  1960    13,411.0
...             ...   ...         ...
15835        Kosovo  2019         nan
15836   Yemen, Rep.  2019         nan
15837  South Africa  2019         nan
15838        Zambia  2019         nan
15839      Zimbabwe  2019         nan

[15840 rows x 3 columns]

In [85]:
# Convertimos la variable year a una variable categorica
# df['year'] = pd.categorical(df['year'].apply(str))
df['year'] = df['year'].astype('int')
df.dtypes

Country     object
year         int64
pob        float64
dtype: object

In [86]:
 # Filtro para seleccionar solo a dos paises, para tener una base mas pequena
 idx_filtro = df['Country'].isin(['Aruba', 'Colombia'])
 idx_filtro.head()

0     True
1    False
2    False
3    False
4    False
Name: Country, dtype: bool

In [87]:
df_sample = df[idx_filtro]
df_sample = df_sample.query('year >= 2015 & year <= 2018')
df_sample

        Country  year          pob
14520     Aruba  2015    104,341.0
14563  Colombia  2015 47,520,667.0
14784     Aruba  2016    104,872.0
14827  Colombia  2016 48,171,392.0
15048     Aruba  2017    105,366.0
15091  Colombia  2017 48,901,066.0
15312     Aruba  2018    105,845.0
15355  Colombia  2018 49,648,685.0

In [79]:
df_sample['year'] = df_sample['year'].astype('category')
df_sample.dtypes

Country      object
year       category
pob         float64
dtype: object

In [88]:
df_sample = df_sample.set_index(['Country', 'year'])
df_sample

                       pob
Country  year
Aruba    2015    104,341.0
Colombia 2015 47,520,667.0
Aruba    2016    104,872.0
Colombia 2016 48,171,392.0
Aruba    2017    105,366.0
Colombia 2017 48,901,066.0
Aruba    2018    105,845.0
Colombia 2018 49,648,685.0

In [89]:
df_sample.sort_index()

                       pob
Country  year
Aruba    2015    104,341.0
         2016    104,872.0
         2017    105,366.0
         2018    105,845.0
Colombia 2015 47,520,667.0
         2016 48,171,392.0
         2017 48,901,066.0
         2018 49,648,685.0

In [90]:
df_sample.loc['Colombia',:]

              pob
year
2015 47,520,667.0
2016 48,171,392.0
2017 48,901,066.0
2018 49,648,685.0

In [93]:
df_sample.loc['Colombia', :].loc[2016, :]

pob   48,171,392.0
Name: 2016, dtype: float64

In [94]:
df_sample.xs(['Aruba'])

           pob
year
2015 104,341.0
2016 104,872.0
2017 105,366.0
2018 105,845.0

In [95]:
df_sample.xs(['Aruba', 2018])

pob   105,845.0
Name: (Aruba, 2018), dtype: float64

In [96]:
df_sample.xs(2018, level=1)

                  pob
Country
Aruba       105,845.0
Colombia 49,648,685.0

In [102]:
df_countries = df.set_index(['Country', 'year']).sort_index(ascending=[True, True])
df_countries

                          pob
Country     year
Afghanistan 1960  8,996,973.0
            1961  9,169,410.0
            1962  9,351,441.0
            1963  9,543,205.0
            1964  9,744,781.0
...                       ...
Zimbabwe    2015 13,814,629.0
            2016 14,030,390.0
            2017 14,236,745.0
            2018 14,439,018.0
            2019          nan

[15840 rows x 1 columns]

In [103]:
df_countries.loc[pd.IndexSlice['Aruba':'Austria', 2015:2017], :].sort_index()

                        pob
Country   year
Aruba     2015    104,341.0
          2016    104,872.0
          2017    105,366.0
Australia 2015 23,815,995.0
          2016 24,190,907.0
          2017 24,601,860.0
Austria   2015  8,642,699.0
          2016  8,736,668.0
          2017  8,797,566.0

In [106]:
df_countries['pob']

Country      year
Afghanistan  1960    8,996,973.0
             1961    9,169,410.0
             1962    9,351,441.0
             1963    9,543,205.0
             1964    9,744,781.0
                        ...
Zimbabwe     2015   13,814,629.0
             2016   14,030,390.0
             2017   14,236,745.0
             2018   14,439,018.0
             2019            nan
Name: pob, Length: 15840, dtype: float64

In [108]:
df_countries['pob']['Colombia'].head()

year
1960   16,057,724.0
1961   16,567,811.0
1962   17,092,918.0
1963   17,629,979.0
1964   18,175,185.0
Name: pob, dtype: float64

In [109]:
df_countries['pob']['Colombia'][2018]

49648685.0

In [111]:
df_countries.sum(level='year').head()

                  pob
year
1960 30,693,182,639.0
1961 31,105,215,070.0
1962 31,655,829,712.0
1963 32,341,125,029.0
1964 33,031,792,191.0

In [112]:
df_sample.unstack('year')

                  pob
year             2015         2016         2017         2018
Country
Aruba       104,341.0    104,872.0    105,366.0    105,845.0
Colombia 47,520,667.0 48,171,392.0 48,901,066.0 49,648,685.0

In [113]:
df_sample.unstack('Country')

              pob
Country     Aruba     Colombia
year
2015    104,341.0 47,520,667.0
2016    104,872.0 48,171,392.0
2017    105,366.0 48,901,066.0
2018    105,845.0 49,648,685.0